import * as React from 'react';
import { ClassInfo } from './Misc';
import './Result.css';
import Data from './data.json';

interface Props {
	items: ClassInfo[];
}

export const Result = (props: Props) => {
	// 結果を保存する用の配列と初期化
	var result: number[] = new Array(8);
	result.fill(0);

	//data.jsonからimportしたのがパースできないので埋め込み
	const json = `{
  "0AH0201": {
    "g1": 30,
    "g2": 20,
    "g3": 30,
    "g4": 10,
    "g5": 10,
    "p1": 10,
    "p2": 30,
    "p3": 60,
    "name": "美しい国土づくりへの挑戦(I)"
  },
  "0AH0202": {
    "g1": 30,
    "g2": 20,
    "g3": 30,
    "g4": 10,
    "g5": 10,
    "p1": 10,
    "p2": 30,
    "p3": 60,
    "name": "美しい国土づくりへの挑戦(II)"
  },
  "0AH0203": {
    "g1": 25,
    "g2": 50,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 125,
    "p3": 0,
    "name": "再生可能エネルギー工学"
  },
  "0AH0204": {
    "g1": 20,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 40,
    "p3": 0,
    "name": "リスク・レジリエンス工学概論"
  },
  "0AH0205": {
    "g1": 30,
    "g2": 30,
    "g3": 40,
    "g4": 40,
    "g5": 0,
    "p1": 30,
    "p2": 30,
    "p3": 0,
    "name": "ICT社会イノベーション特論"
  },
  "0AH0206": {
    "g1": 20,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 20,
    "p1": 30,
    "p2": 30,
    "p3": 0,
    "name": "計算科学リテラシー"
  },
  "0AH0207": {
    "g1": 20,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 20,
    "p1": 30,
    "p2": 30,
    "p3": 0,
    "name": "Computational Science Literacy"
  },
  "0AH0208": {
    "g1": 20,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 20,
    "p1": 30,
    "p2": 30,
    "p3": 0,
    "name": "計算科学のための高性能並列計算技術(日本語)"
  },
  "0AH0209": {
    "g1": 20,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 20,
    "p1": 30,
    "p2": 30,
    "p3": 0,
    "name": "High Performance Parallel Computing Technology for Computational Sciences"
  },
  "0AH0210": {
    "g1": 25,
    "g2": 25,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 50,
    "p3": 0,
    "name": "機械工作序論と実習"
  },
  "0AL0300": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "ソフトコンピューティング基礎論"
  },
  "0AL0301": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "データマイニング"
  },
  "0AL0302": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "暗号技術特論"
  },
  "0AL0303": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "現代情報理論"
  },
  "0AL0304": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "数理モデル解析特論"
  },
  "0AL0305": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "数理環境工学特論"
  },
  "0AL0400": {
    "g1": 30,
    "g2": 20,
    "g3": 0,
    "g4": 50,
    "g5": 10,
    "p1": 40,
    "p2": 0,
    "p3": 50,
    "name": "Experiment Design in Computer Sciences"
  },
  "0AL0401": {
    "g1": 10,
    "g2": 10,
    "g3": 60,
    "g4": 20,
    "g5": 0,
    "p1": 0,
    "p2": 0,
    "p3": 0,
    "name": "インストラクショナルデザイン"
  },
  "0AL0402": {
    "g1": 50,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 50,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "データ解析特論"
  },
  "0AL5300": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "エネルギー・環境モデリング演習"
  },
  "0AL5301": {
    "g1": 20,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 20,
    "p2": 60,
    "p3": 0,
    "name": "サイバーリスク特論"
  },
  "0AL5302": {
    "g1": 20,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 20,
    "p2": 60,
    "p3": 0,
    "name": "サイバーレジリエンス演習"
  },
  "0AL5303": {
    "g1": 20,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 20,
    "p2": 60,
    "p3": 0,
    "name": "セキュリティ論考特論"
  },
  "0AL5304": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "ネットワークセキュリティ特論"
  },
  "0AL5305": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "ヒューマンファクター演習"
  },
  "0AL5306": {
    "g1": 20,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 20,
    "p2": 60,
    "p3": 0,
    "name": "ヒューマンファクター特論"
  },
  "0AL5307": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "プロセスシステムリスク特論"
  },
  "0AL5310": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "リスクコミュニケーション"
  },
  "0AL5311": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "レジリエンス社会へ向けての事業継続管理"
  },
  "0AL5312": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "レジリエント都市計画演習"
  },
  "0AL5313": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "環境・エネルギー・安全工学概論"
  },
  "0AL5314": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "金融リスク解析"
  },
  "0AL5315": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "災害リスク・レジリエンス論"
  },
  "0AL5316": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "サイバーセキュリティ特論"
  },
  "0AL5317": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "都市リスクマネジメント論"
  },
  "0AL5318": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 120,
    "p3": 0,
    "name": "認知的インタフェース論"
  },
  "0AL5400": {
    "g1": 30,
    "g2": 0,
    "g3": 0,
    "g4": 50,
    "g5": 20,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "Principles of Software Engineering"
  },
  "0AL5401": {
    "g1": 50,
    "g2": 0,
    "g3": 30,
    "g4": 0,
    "g5": 30,
    "p1": 40,
    "p2": 50,
    "p3": 0,
    "name": "コンピュータグラフィクス特論"
  },
  "0AL5402": {
    "g1": 20,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 30,
    "p1": 20,
    "p2": 30,
    "p3": 0,
    "name": "コンピュータサイエンス英語講義I"
  },
  "0AL5403": {
    "g1": 40,
    "g2": 30,
    "g3": 30,
    "g4": 0,
    "g5": 0,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "コンピュータネットワーク特論"
  },
  "0AL5404": {
    "g1": 30,
    "g2": 0,
    "g3": 10,
    "g4": 10,
    "g5": 0,
    "p1": 10,
    "p2": 10,
    "p3": 30,
    "name": "サービスとデータプライバシ"
  },
  "0AL5405": {
    "g1": 60,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 70,
    "p2": 70,
    "p3": 0,
    "name": "システムプログラミング特論"
  },
  "0AL5406": {
    "g1": 30,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 10,
    "p1": 40,
    "p2": 20,
    "p3": 0,
    "name": "システム最適化"
  },
  "0AL5407": {
    "g1": 30,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 10,
    "p1": 40,
    "p2": 20,
    "p3": 0,
    "name": "システム制御"
  },
  "0AL5408": {
    "g1": 10,
    "g2": 10,
    "g3": 0,
    "g4": 10,
    "g5": 0,
    "p1": 20,
    "p2": 50,
    "p3": 0,
    "name": "ソフトウェアリポジトリ分析技法"
  },
  "0AL5409": {
    "g1": 40,
    "g2": 40,
    "g3": 40,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 40,
    "p3": 0,
    "name": "データ工学特論I"
  },
  "0AL5410": {
    "g1": 50,
    "g2": 50,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "データ工学特論II"
  },
  "0AL5411": {
    "g1": 20,
    "g2": 0,
    "g3": 20,
    "g4": 0,
    "g5": 0,
    "p1": 30,
    "p2": 30,
    "p3": 0,
    "name": "ヒューマンインタフェース特論I"
  },
  "0AL5412": {
    "g1": 20,
    "g2": 0,
    "g3": 20,
    "g4": 0,
    "g5": 0,
    "p1": 30,
    "p2": 30,
    "p3": 0,
    "name": "ヒューマンインタフェース特論II"
  },
  "0AL5413": {
    "g1": 40,
    "g2": 0,
    "g3": 60,
    "g4": 20,
    "g5": 30,
    "p1": 0,
    "p2": 50,
    "p3": 0,
    "name": "プログラミング環境特論"
  },
  "0AL5414": {
    "g1": 50,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 50,
    "p3": 0,
    "name": "プログラム言語特論"
  },
  "0AL5415": {
    "g1": 30,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 20,
    "p2": 50,
    "p3": 0,
    "name": "プログラム理論特論"
  },
  "0AL5416": {
    "g1": 30,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 30,
    "p2": 40,
    "p3": 0,
    "name": "音声メディア工学特論"
  },
  "0AL5417": {
    "g1": 50,
    "g2": 20,
    "g3": 20,
    "g4": 0,
    "g5": 0,
    "p1": 60,
    "p2": 50,
    "p3": 0,
    "name": "画像認識特論"
  },
  "0AL5418": {
    "g1": 50,
    "g2": 20,
    "g3": 30,
    "g4": 0,
    "g5": 0,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "回路工学特論"
  },
  "0AL5419": {
    "g1": 60,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 70,
    "p2": 70,
    "p3": 0,
    "name": "基礎計算生物学"
  },
  "0AL5420": {
    "g1": 50,
    "g2": 30,
    "g3": 20,
    "g4": 0,
    "g5": 0,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "計算言語学特論"
  },
  "0AL5421": {
    "g1": 50,
    "g2": 0,
    "g3": 20,
    "g4": 0,
    "g5": 30,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "高性能コンピューティング特論"
  },
  "0AL5422": {
    "g1": 40,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 10,
    "p1": 20,
    "p2": 20,
    "p3": 10,
    "name": "視覚計算特論"
  },
  "0AL5423": {
    "g1": 50,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 50,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "集積システム工学"
  },
  "0AL5424": {
    "g1": 30,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 30,
    "p2": 40,
    "p3": 0,
    "name": "信号画像処理特論I"
  },
  "0AL5425": {
    "g1": 30,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 30,
    "p2": 40,
    "p3": 0,
    "name": "信号画像処理特論II"
  },
  "0AL5426": {
    "g1": 30,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 30,
    "p2": 40,
    "p3": 0,
    "name": "信号画像処理特論III"
  },
  "0AL5427": {
    "g1": 60,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 70,
    "p2": 70,
    "p3": 0,
    "name": "数値シミュレーション特論"
  },
  "0AL5428": {
    "g1": 50,
    "g2": 20,
    "g3": 0,
    "g4": 0,
    "g5": 30,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "数理アルゴリズム特論"
  },
  "0AL5429": {
    "g1": 20,
    "g2": 10,
    "g3": 30,
    "g4": 40,
    "g5": 0,
    "p1": 40,
    "p2": 60,
    "p3": 0,
    "name": "知能感性処理特論"
  },
  "0AL5430": {
    "g1": 10,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 20,
    "p1": 20,
    "p2": 50,
    "p3": 0,
    "name": "適応的メディア処理"
  },
  "0AL5431": {
    "g1": 50,
    "g2": 30,
    "g3": 20,
    "g4": 0,
    "g5": 0,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "統計的言語モデル特論"
  },
  "0AL5432": {
    "g1": 50,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 70,
    "p2": 80,
    "p3": 0,
    "name": "非線形システム特論"
  },
  "0AL5433": {
    "g1": 50,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 70,
    "p2": 80,
    "p3": 0,
    "name": "分散システム特論"
  },
  "0AL5434": {
    "g1": 40,
    "g2": 30,
    "g3": 30,
    "g4": 0,
    "g5": 0,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "並行システム"
  },
  "0AL5435": {
    "g1": 50,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 50,
    "p1": 50,
    "p2": 50,
    "p3": 0,
    "name": "並列処理アーキテクチャ特論"
  },
  "0AL5436": {
    "g1": 0,
    "g2": 0,
    "g3": 50,
    "g4": 0,
    "g5": 0,
    "p1": 70,
    "p2": 80,
    "p3": 0,
    "name": "並列分散システム特論"
  },
  "0AL5440": {
    "g1": 30,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 40,
    "p2": 30,
    "p3": 0,
    "name": "暗号理論特論II"
  },
  "0AL5437": {
    "g1": 20,
    "g2": 20,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 30,
    "p2": 30,
    "p3": 0,
    "name": "フロンティアインフォマティクス特論A"
  },
  "0AL5438": {
    "g1": 20,
    "g2": 20,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 30,
    "p2": 30,
    "p3": 0,
    "name": "フロンティアインフォマティクス特論B"
  },
  "0AL5500": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "コンテンツ工学"
  },
  "0AL5501": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "サイバニクス"
  },
  "0AL5502": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "システムモデリング"
  },
  "0AL5503": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "スマートインフォメディアシステム特論"
  },
  "0AL5504": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "ソーシャルロボティクス"
  },
  "0AL5505": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "通信基礎論"
  },
  "0AL5506": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "デジタル制御特論"
  },
  "0AL5507": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "バーチャルリアリティ"
  },
  "0AL5508": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "ユーザビリティテスティング"
  },
  "0AL5509": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "ロボット制御論"
  },
  "0AL5510": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "運動制御論"
  },
  "0AL5511": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "音響工学特論"
  },
  "0AL5512": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "機械学習論"
  },
  "0AL5513": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "実世界指向センシング"
  },
  "0AL5514": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "言語情報処理特論"
  },
  "0AL5515": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "錯覚とインタフェース"
  },
  "0AL5516": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "視覚システム論"
  },
  "0AL5517": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "自律移動ロボット学"
  },
  "0AL5519": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "ヒューマンエージェントインタラクション"
  },
  "0AL5520": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "人工知能特論"
  },
  "0AL5521": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "生体計測工学"
  },
  "0AL5522": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "生体情報処理特論"
  },
  "0AL5523": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "知覚拡張工学"
  },
  "0AL5524": {
    "g1": 0,
    "g2": 0,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 200,
    "p3": 0,
    "name": "適応システム構成論"
  },
  "0AL5600": {
    "g1": 25,
    "g2": 25,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 150,
    "p3": 0,
    "name": "マイクロメカニックス"
  },
  "0AL5601": {
    "g1": 25,
    "g2": 50,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 125,
    "p3": 0,
    "name": "圧縮性流れの力学"
  },
  "0AL5602": {
    "g1": 15,
    "g2": 15,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 70,
    "p3": 0,
    "name": "宇宙開発工学特論"
  },
  "0AL5603": {
    "g1": 25,
    "g2": 25,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 150,
    "p3": 0,
    "name": "環境流体工学特論"
  },
  "0AL5604": {
    "g1": 25,
    "g2": 50,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 125,
    "p3": 0,
    "name": "計算力学特論"
  },
  "0AL5605": {
    "g1": 25,
    "g2": 25,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 150,
    "p3": 0,
    "name": "原子炉構造設計"
  },
  "0AL5606": {
    "g1": 25,
    "g2": 25,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 150,
    "p3": 0,
    "name": "構造物設計法論"
  },
  "0AL5607": {
    "g1": 25,
    "g2": 25,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 150,
    "p3": 0,
    "name": "混相流工学"
  },
  "0AL5608": {
    "g1": 25,
    "g2": 25,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 150,
    "p3": 0,
    "name": "材料強度学特論"
  },
  "0AL5609": {
    "g1": 25,
    "g2": 50,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 125,
    "p3": 0,
    "name": "信頼性工学特論"
  },
  "0AL5610": {
    "g1": 25,
    "g2": 25,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 150,
    "p3": 0,
    "name": "数値流体力学"
  },
  "0AL5611": {
    "g1": 25,
    "g2": 25,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 150,
    "p3": 0,
    "name": "耐震工学特論"
  },
  "0AL5612": {
    "g1": 25,
    "g2": 25,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 150,
    "p3": 0,
    "name": "地盤工学特論"
  },
  "0AL5613": {
    "g1": 25,
    "g2": 50,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 125,
    "p3": 0,
    "name": "輸送現象論"
  },
  "0AL5614": {
    "g1": 25,
    "g2": 50,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 125,
    "p3": 0,
    "name": "熱・流体計測法"
  },
  "0AL5615": {
    "g1": 25,
    "g2": 25,
    "g3": 0,
    "g4": 0,
    "g5": 0,
    "p1": 0,
    "p2": 150,
    "p3": 0,
    "name": "複合構造特論"
  },
  "0ATGA21": {
    "g1": 10,
    "g2": 10,
    "g3": 20,
    "g4": 20,
    "g5": 10,
    "p1": 10,
    "p2": 10,
    "p3": 10,
    "name": "インターンシップI"
  },
  "0ATGA22": {
    "g1": 10,
    "g2": 10,
    "g3": 20,
    "g4": 20,
    "g5": 10,
    "p1": 10,
    "p2": 10,
    "p3": 10,
    "name": "インターンシップII"
  },
  "0ALD002": {
    "g1": 30,
    "g2": 30,
    "g3": 30,
    "g4": 30,
    "g5": 0,
    "p1": 40,
    "p2": 40,
    "p3": 0,
    "name": "プロジェクト実践ワークショップ"
  },
  "0ALD500": {
    "g1": 30,
    "g2": 30,
    "g3": 30,
    "g4": 30,
    "g5": 0,
    "p1": 40,
    "p2": 40,
    "p3": 0,
    "name": "イニシアティブプロジェクトI"
  },
  "0ALD501": {
    "g1": 30,
    "g2": 30,
    "g3": 30,
    "g4": 30,
    "g5": 0,
    "p1": 40,
    "p2": 40,
    "p3": 0,
    "name": "イニシアティブプロジェクトII"
  },
  "0ALD502": {
    "g1": 20,
    "g2": 20,
    "g3": 30,
    "g4": 40,
    "g5": 0,
    "p1": 50,
    "p2": 40,
    "p3": 0,
    "name": "組込みプログラム開発"
  },
  "0ALD503": {
    "g1": 30,
    "g2": 20,
    "g3": 20,
    "g4": 20,
    "g5": 20,
    "p1": 30,
    "p2": 30,
    "p3": 30,
    "name": "情報理工前期特別演習"
  },
  "0ALD504": {
    "g1": 50,
    "g2": 50,
    "g3": 50,
    "g4": 50,
    "g5": 50,
    "p1": 50,
    "p2": 50,
    "p3": 50,
    "name": "情報理工前期特別研究I"
  },
  "0ALD505": {
    "g1": 80,
    "g2": 70,
    "g3": 70,
    "g4": 70,
    "g5": 70,
    "p1": 80,
    "p2": 80,
    "p3": 80,
    "name": "情報理工前期特別研究II"
  },
  "0ALD506": {
    "g1": 15,
    "g2": 10,
    "g3": 10,
    "g4": 10,
    "g5": 10,
    "p1": 15,
    "p2": 15,
    "p3": 15,
    "name": "情報理工前期特別演習s"
  },
  "0ALD507": {
    "g1": 15,
    "g2": 10,
    "g3": 10,
    "g4": 10,
    "g5": 10,
    "p1": 15,
    "p2": 15,
    "p3": 15,
    "name": "情報理工前期特別演習f"
  }
}`;

	var data = JSON.parse(json);

	// console.log(data);
	for (var i = 0; i < props.items.length; i++) {
		var flag = 0;
		for (var obj in data) {
			if (obj === props.items[i].classID.replace(/\"/g, '')) {
				result[0] += data[obj].g1;
				result[1] += data[obj].g2;
				result[2] += data[obj].g3;
				result[3] += data[obj].g4;
				result[4] += data[obj].g5;
				result[5] += data[obj].p1;
				result[6] += data[obj].p2;
				result[7] += data[obj].p3;
				flag = 1;
				break;
			}
		}
		if (flag === 0) {
			//見つからなかったとき
			alert(props.items[i].className + ' not found!!');
		}
	}

	return (
		<div className="Result">
			<h4>コンピテンシ</h4>
			{/* <p>緑色が超過しているポイント，赤色が不足しているポイント．</p> */}
			<table>
				<thead>
					<tr>
						<th colSpan={5}>汎用コンピテンス</th>
						<th colSpan={3}>専門コンピテンス</th>
					</tr>
					<tr>
						<th>1.知の活用力</th>
						<th>2.マネジメント能力</th>
						<th>3.コミュニケーション能力</th>
						<th>4.チームワーク力</th>
						<th>5.国際性</th>
						<th>1.研究力</th>
						<th>2.専門知識</th>
						<th>3.倫理観</th>
					</tr>
				</thead>
				<tbody>
					{
						<tr>
							<td>{result[0]}</td>
							<td>{result[1]}</td>
							<td>{result[2]}</td>
							<td>{result[3]}</td>
							<td>{result[4]}</td>
							<td>{result[5]}</td>
							<td>{result[6]}</td>
							<td>{result[7]}</td>
						</tr>
					}
				</tbody>
			</table>
		</div>
	);
};
